
ignore_content = "仅供参考|查询为准"

re_start_end_date = [
    "[\\d]{4}-[\\d]{2}-[\\d]{2}",
    "[\\d]{4}/[\\d]{2}/[\\d]{2}",
    "[\\d]{4}年[\\d]{2}月[\\d]{2}日",
    "[\\d]{8}",
    "[\\d]{6}",
]

kw_bank_name = ['银⾏', '银行', '微信支付', '支付宝']
kw_bank_name_d = ['开户行', '开户机构']
kw_bank_account = {
    "include": ['卡[\\s]*号[\\s\\:\\：]', '账[\\s]*号[\\s\\:\\：]', '账[\\s]*⼾[\\s\\:\\：]', '账[\\s]*户[\\s\\:\\：]', '账户号'],
    "exclude": ['账户名称']
}
kw_user_name = ['客户名称', '账户名称', '客户姓名', '户[\\s]*名', '⼾[\\s]*名', '兹证明']
kw_row_count = ['总笔数']

kw_start_end = ['起⽌⽇期', '起止日期', '账务日期', '交易日期', '账单统计日期', '交易明细对应时间段', '收支明细对应的期间', '交易时间段', '查询时间范围(.*[\\]])?']
kw_start_end_no_title = ['[\\d]{4}-[\\d]{2}-[\\d]{2}[\\s\\-\\—]+[\\d]{4}-[\\d]{2}-[\\d]{2}']

kw_start = ['开始日期', '起始日期']
kw_end = ['结束日期', '终止日期', '截止日期']

# 匹配excel里的字段
x_kw_bank_account = {
    "include": ['卡[\\s]*号', '账[\\s]*号', '账[\\s]*⼾', '账[\\s]*户', '帐号'],
    "exclude": ['账⼾活期交易', '账户全部交易明细', '账户交易明细', '账户明细']
}

kw_sep = [':', '：']
kw_stop_flag = '(（\n'


reg_to_format = [
        ["[\\d]{4}-[\\d]{2}-[\\d]{2}", ""],
        ["[\\d]{4}/[\\d]{2}/[\\d]{2}", "%Y/%m/%d"],
        ["[\\d]{4}年[\\d]{2}月[\\d]{2}日", "%Y年%m月%d日"],
        ["[\\d]{4}-[\\d]{2}-[\\d]{2}[\\s]+[\\d]{2}:[\\d]{2}:[\\d]{2}", "%Y-%m-%d %H:%M:%S"],
        ["[\\d]{8}", "%Y%m%d"],
        ["[\\d]{6}", "%Y%m"],
    ]

trans_header_max_rows = 10

trans_title_min_cols = 6
trans_title_max_cols = 8

