# @Time : 3/3/22 11:02 AM 
# @Author : lixiaobo
# @File : column_mapping.py 
# @Software: PyCharm

TITLE_RECTIFY = {
    "渠道": [
        '深道', '柒道', '噪道', '澡道'
    ],

    "日志号": [
        '口志号', '二志号', '三志号'
    ],

    "交易时间": [
        '交易川间', '交易口寸间', '交易日寸间', '交易时问', '时间'
    ],

    "交易行号": [
        "交易行"
    ],

    '对方账户': [
        '对手账户', '对手账号', '对方账号', '卡号', '对方账户或卡号'
    ]
}


CHAR_MAPPING = {
    '日': ['⽇']
    , '金': ['⾦']
    , '手': ['⼿']
    , '户': ['⼾']
    , '行': ['⾏']
    , '网': ['⽹']
    , '子': ['⼦']
    , '支': ['⽀']
    , '入': ['⼊']
    , '水': ['⽔']
}
